app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New Thang"], ["description", "Stuff about the new thang\r\n"], ["price", 1.0], ["created_at", 2017-03-30 20:56:59 UTC], ["updated_at", 2017-03-30 20:56:59 UTC]]
---
  def create
    # params is a big hash, it takes the product key
    # inside the product key, it takes the three values inside it
    product_params = params.require(:product).permit([:title, :description, :price])
    @product = Product.new product_params
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 913], ["LIMIT", 1]]
---
  def show
    @products = Product.find params[:id]

SELECT  "products".* FROM "products" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 20]]
---
  def index
    @products = Product.offset(20).limit(20)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 21]]
---
  def destroy
    product = Product.find params[:id]
    product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def edit
    @product = Product.find params[:id]

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "YAH aesthetic tousled wayfarers microdosing diy."], ["updated_at", 2017-03-30 21:34:41 UTC], ["id", 23]]
---
  def update
    @product = Product.find params[:id]
    product_params = params.require(:product).permit([:title, :description, :price])
    if @product.update(product_params)